УТ_для_edt/src/Documents/смартКорректировкаГТДНеДляПродажи/смартКорректировкаГТДНеДляПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартКорректировкаГТДНеДляПродажи</name>
  <comment>//++ #1419 смарт: Фролов 17.08.2023 //Контроль использования запчастей не для продажи</comment>
  <registerRecords>AccumulationRegister.смартКонтрольИспользованияЗапЧастейНеДляПродажи</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаГарантийныйРемонт</name>
      <type>
        <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТДКВозмещению</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТДПриход</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляЗамены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоступившее</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеДляЗамены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартКонтрольИспользованияЗапЧастейНеДляПродажи/смартКонтрольИспользованияЗапЧастейНеДляПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартКонтрольИспользованияЗапЧастейНеДляПродажи</name>
  <comment>//++ #1419 смарт: Фролов 16.08.2023 //Контроль использования запчастей не для продажи</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КВозмещению</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаГарантийныйРемонт</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТДКВозмещению</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТДПриход</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НеКомпенсировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ДокументПартии</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Documents/КорректировкаРегистров/КорректировкаРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаРегистров</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваУПодотчетныхЛиц</registerRecords>
  <registerRecords>InformationRegister.Ассортимент</registerRecords>
  <registerRecords>AccumulationRegister.смартОборудованиеКРазборке</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварныеМестаКОтражениюИзлишковНедостач</registerRecords>
  <registerRecords>InformationRegister.НормативыРаспределенияПлановПродажПоКатегориям</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПланОплат</registerRecords>
  <registerRecords>AccumulationRegister.смартЗаявкиНаРазборкуОборудования</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиНаВозвратТоваровОтКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.смартГрафикОтгрузкиТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПланПоставок</registerRecords>
  <registerRecords>AccumulationRegister.смартСвободныеОстаткиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИсторияПодарочныхСертификатов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрослеживаемыеТоварыОтгруженныеВЕАЭС</registerRecords>
  <registerRecords>AccumulationRegister.ГрафикОтгрузкиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютеРегл</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПланОтгрузок</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаСборку</registerRecords>
  <registerRecords>AccumulationRegister.ПланыПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровПереданныеНаКомиссию</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваБезналичные</registerRecords>
  <registerRecords>InformationRegister.БлокировкиСкладскихЯчеек</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоСрокам</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатурыПоставщиков</registerRecords>
  <registerRecords>AccumulationRegister.смартТоварыНаСкладахОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииНДСКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоСрокам</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПланОплат</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваНаличные</registerRecords>
  <registerRecords>AccumulationRegister.ПланыЗакупок</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныеСредстваКонтрагент</registerRecords>
  <registerRecords>AccumulationRegister.ПереданнаяВозвратнаяТара</registerRecords>
  <registerRecords>AccumulationRegister.ПодарочныеСертификаты</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.смартОстаткиНаСкладеГарантийныхЗапчастей</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВПути</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтбору</registerRecords>
  <registerRecords>AccumulationRegister.ЛимитыРасходаДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВКассахККМ</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПеремещение</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.ОшибочныеРеквизитыКонтрагентов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>InformationRegister.СтоимостьТоваров</registerRecords>
  <registerRecords>InformationRegister.ДанныеОснованийСчетовФактур</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыПереданныеНаКомиссию</registerRecords>
  <registerRecords>AccumulationRegister.ФинансовыеРезультаты</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКВыплате</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <registerRecords>AccumulationRegister.смартГрафикПоступленияТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказовРаботами</registerRecords>
  <registerRecords>AccumulationRegister.ПланыПродажПоКатегориям</registerRecords>
  <registerRecords>AccumulationRegister.смартТоварыКОтборуОрганизаций</registerRecords>
  <registerRecords>InformationRegister.КвотыАссортимента</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередаче</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныеСредстваДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПланыСборкиРазборки</registerRecords>
  <registerRecords>AccumulationRegister.ПланыОплатПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюЗаявленийОВвозе</registerRecords>
  <registerRecords>AccumulationRegister.ПланыОстатков</registerRecords>
  <registerRecords>AccumulationRegister.смартДвиженияГарантийныхЗапасныхЧастей</registerRecords>
  <registerRecords>AccumulationRegister.ПланыПотребленияКомплектующих</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыИРаботыВПроизводстве</registerRecords>
  <registerRecords>AccumulationRegister.ВыручкаИСебестоимостьПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентКонтрагент</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоФинансовымИнструментам</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюДокументовИмпорта</registerRecords>
  <registerRecords>AccumulationRegister.смартТоварыКОтгрузкеОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураНоменклатура</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ТМЦВЭксплуатации</registerRecords>
  <registerRecords>AccumulationRegister.ПланыОплатКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ПринятаяВозвратнаяТара</registerRecords>
  <registerRecords>InformationRegister.НДССостояниеРеализации0</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллы</registerRecords>
  <registerRecords>InformationRegister.ЖурналУчетаСчетовФактур</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ГрафикПоступленияТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.смартОборудованиеКСборке</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПроизводственныхЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЭквайрингу</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <registerRecords>AccumulationRegister.УслугиКОформлениюОтчетовПринципалу</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииКорректировкиРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>смартКорректировкаГТДНеДляПродажи</name>
    <comment>//++ #1419 смарт: Фролов 22.08.2023 //Контроль использования запчастей не для продажи</comment>
    <type>
      <types>DocumentRef.смартКорректировкаГТДНеДляПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВыводТоваровИзОборота</name>
    <comment>//++ #1686 смарт: Мосолов 18.03.2024 // Создать механизм ручного резервирования товаров (временного вывода из оборота)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРегистров</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/смартКорректировкаГТДНеДляПродажи/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Записывать=Истина;
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КорректировкаРегистров.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	                    |ГДЕ
	                    |	КорректировкаРегистров.смартКорректировкаГТДНеДляПродажи = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбКорректировка=Выборка.Ссылка.ПолучитьОбъект();	
	Иначе
		ОбКорректировка=Документы.КорректировкаРегистров.СоздатьДокумент();
		ОбКорректировка.Дата=Дата;
		ОбКорректировка.Операция=Перечисления.ОперацииКорректировкиРегистров.РучнаяКорректировка;
		ОбКорректировка.Ответственный=Ответственный; 
		ОбКорректировка.смартКорректировкаГТДНеДляПродажи=Ссылка;
		ОбКорректировка.Комментарий=""+Ответственный.Наименование+"; Восстановление ГТД списанной для ремонта запчасти.";
	КонецЕсли;
	ОбКорректировка.Движения.ТоварыОрганизаций.Очистить();
	ОбКорректировка.ТаблицаРегистров.Очистить();
	СтрТаблицаРегистров=ОбКорректировка.ТаблицаРегистров.Добавить(); 
	СтрТаблицаРегистров.Имя="ТоварыОрганизаций";
	ОбКорректировка.Записать(РежимЗаписиДокумента.Запись);
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	смартКорректировкаГТДНеДляПродажиСостав.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Номенклатура КАК Номенклатура,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДКВозмещению КАК НомерГТДКВозмещению,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДПриход КАК НомерГТДПриход,
	                    |	СУММА(смартКорректировкаГТДНеДляПродажиСостав.КоличествоДляЗамены) КАК КоличествоДляЗамены,
	                    |	СУММА(смартКорректировкаГТДНеДляПродажиСостав.КоличествоПоступившее) КАК КоличествоПоступившее,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Партия КАК Партия,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.ВидЗапасов КАК ВидЗапасов,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Организация КАК Организация,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДКВозмещению.смартНеДляПродажи КАК НомерГТДсмартНеДляПродажи
	                    |ИЗ
	                    |	Документ.смартКорректировкаГТДНеДляПродажи.Состав КАК смартКорректировкаГТДНеДляПродажиСостав
	                    |ГДЕ
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Ссылка = &Ссылка
	                    |	И смартКорректировкаГТДНеДляПродажиСостав.Пометка
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартКорректировкаГТДНеДляПродажиСостав.ВидЗапасов,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДПриход,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДКВозмещению,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Партия,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Организация,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.АналитикаУчетаНоменклатуры,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Номенклатура,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.ЗаявкаНаГарантийныйРемонт,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДКВозмещению.смартНеДляПродажи");
	Запрос.УстановитьПараметр("Ссылка",Ссылка);  
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДвижениеГТД=Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Добавить();
		ДвижениеГТД.Период=Дата;
		ДвижениеГТД.ВидДвижения=ВидДвиженияНакопления.Расход;
		ДвижениеГТД.ЗаявкаНаГарантийныйРемонт=Выборка.ЗаявкаНаГарантийныйРемонт;
		ДвижениеГТД.Номенклатура=Выборка.Номенклатура;
		ДвижениеГТД.НомерГТДКВозмещению=Выборка.НомерГТДКВозмещению;
		ДвижениеГТД.КВозмещению=Истина;  
		Если Выборка.НомерГТДсмартНеДляПродажи Тогда 
			ДвижениеГТД.НеКомпенсировать=Истина;	
		КонецЕсли;
		ДвижениеГТД.Количество=Выборка.КоличествоДляЗамены;
		
		ДвижениеГТД=Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Добавить();
		ДвижениеГТД.Период=Дата;
		ДвижениеГТД.ВидДвижения=ВидДвиженияНакопления.Расход;
		ДвижениеГТД.ЗаявкаНаГарантийныйРемонт=Выборка.ЗаявкаНаГарантийныйРемонт;
		ДвижениеГТД.Номенклатура=Выборка.Номенклатура;
		ДвижениеГТД.НомерГТДПриход=Выборка.НомерГТДПриход;
		ДвижениеГТД.Партия=Выборка.Партия;
		ДвижениеГТД.Количество=Выборка.КоличествоПоступившее;
		
		Если ЗначениеЗаполнено(Выборка.АналитикаУчетаНоменклатуры) И ЗначениеЗаполнено(Выборка.ВидЗапасов) Тогда
			СтрКорректировка=ОбКорректировка.Движения.ТоварыОрганизаций.Добавить();
			СтрКорректировка.Организация=Выборка.Организация; 
			СтрКорректировка.Регистратор=ОбКорректировка.Ссылка;
			СтрКорректировка.Период=Дата;
			СтрКорректировка.Активность=Истина;
			СтрКорректировка.ВидДвижения=ВидДвиженияНакопления.Расход;
			СтрКорректировка.НомерГТД=Выборка.НомерГТДКВозмещению;
			СтрКорректировка.АналитикаУчетаНоменклатуры=Выборка.АналитикаУчетаНоменклатуры;
			СтрКорректировка.ВидЗапасов=Выборка.ВидЗапасов;
			СтрКорректировка.Количество=Выборка.КоличествоДляЗамены; 
			СтрКорректировка.РасчетПартий=Ложь;
			СтрКорректировка.Первичное=Ложь; 
			
			СтрКорректировка=ОбКорректировка.Движения.ТоварыОрганизаций.Добавить();
			СтрКорректировка.Организация=Выборка.Организация;
			СтрКорректировка.Регистратор=ОбКорректировка.Ссылка;
			СтрКорректировка.Период=Дата;
			СтрКорректировка.Активность=Истина;
			СтрКорректировка.ВидДвижения=ВидДвиженияНакопления.Приход;
			СтрКорректировка.НомерГТД=Выборка.НомерГТДПриход;
			СтрКорректировка.АналитикаУчетаНоменклатуры=Выборка.АналитикаУчетаНоменклатуры;
			СтрКорректировка.ВидЗапасов=Выборка.ВидЗапасов;
			СтрКорректировка.Количество=Выборка.КоличествоПоступившее; 
			СтрКорректировка.РасчетПартий=Ложь;
			СтрКорректировка.Первичное=Ложь; 
		КонецЕсли;
	КонецЦикла;
	ОбКорректировка.Движения.ТоварыОрганизаций.Записать();  
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Отбор=Новый Структура("Пометка",Истина);
		ТабПомеченных=Состав.Выгрузить(Отбор,);
		Состав.Загрузить(ТабПомеченных); 
	Иначе	
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	КорректировкаРегистров.Ссылка КАК Ссылка
		                    |ИЗ
		                    |	Документ.КорректировкаРегистров КАК КорректировкаРегистров
		                    |ГДЕ
		                    |	КорректировкаРегистров.смартКорректировкаГТДНеДляПродажи = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",Ссылка); 
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбКорректировка=Выборка.Ссылка.ПолучитьОбъект(); 
			ОбКорректировка.Движения.ТоварыОрганизаций.Очистить();
			ОбКорректировка.ТаблицаРегистров.Очистить(); 
			ОбКорректировка.Записать(РежимЗаписиДокумента.Запись);
			ОбКорректировка.Движения.ТоварыОрганизаций.Записать();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
